---
kind: type
id: T:Autodesk.Revit.DB.Events.ViewsExportedByContextEventArgs
source: html/141e1a8c-7675-bb1f-fe54-eaf00b2bd75b.htm
---
# Autodesk.Revit.DB.Events.ViewsExportedByContextEventArgs

The event arguments used by the ViewsExportedByContext event.

## Syntax (C#)
```csharp
public class ViewsExportedByContextEventArgs : RevitAPIPostDocEventArgs
```